Tekla.Structures.ComponentDefinitionTypeEnum
The component definition type tells what kind of a component is in question.

Tekla.Structures.ComponentDefinitionTypeEnum.SYSTEM
With the type system, component is defined using developer-kit

Tekla.Structures.ComponentDefinitionTypeEnum.CUSTOM
With the type custom, component is defined as custom component

Tekla.Structures.ComponentDefinitionTypeEnum.DOTNET
With the type dotnet, component is defined using .NET plug-in interface

Tekla.Structures.ComponentDefinitionTypeEnum.DOTNET_CONNECTION
With the type dotnet_connection, connection is defined using .NET plug-in interface

Tekla.Structures.ComponentDefinitionTypeEnum.DOTNET_DRAWING
With the type dotnet_drawing, drawing component is defined using .NET drawing plug-in interface